In [1]:
# pull in dependencies
import pandas as pd

In [17]:
# read in csv files
annual_hours = pd.read_csv('Data/Working_hours/annual_working_hours.csv')
gdp = pd.read_csv('Data/Working_hours/gdppercapita_vs_annual_hours_worked.csv')
home_hours = pd.read_csv('Data/Working_hours/home_hours_and_gender_USA.csv')
producitivty = pd.read_csv('Data/Working_hours/productivity_vs_annual_hours_worked.csv')
hours_weekly = pd.read_csv('Data/Working_hours/work_hours_per_week.csv')

In [19]:
# removes all data with years prior to 1900
annual_hours = annual_hours.loc[annual_hours["Year"]>1949,:]
USA = annual_hours.loc[annual_hours['Code']=='USA',:]
annual_hours.count()

Entity                                                                       3373
Code                                                                         3373
Year                                                                         3373
Average annual hours worked by persons engaged (hours per person engaged)    3373
dtype: int64

In [4]:
# removes all data with years prior to 1900
gdp.head()

,Entity,Code,Year,Working hours (hours per person engaged),GDP per capita (int.-$) (constant 2011 international $),Unnamed: 5
0,Afghanistan,AFG,1800,NaN,NaN,3280000.0
1,Afghanistan,AFG,1801,NaN,NaN,3280000.0
2,Afghanistan,AFG,1802,NaN,NaN,3280000.0
3,Afghanistan,AFG,1803,NaN,NaN,3280000.0
4,Afghanistan,AFG,1804,NaN,NaN,3280000.0

In [5]:
# removes all data with years prior to 1900
home_hours.head()

    Entity  Code  Year  Hours
0  Men 14+   NaN  1900    4.0
1  Men 14+   NaN  1910    4.1
2  Men 14+   NaN  1920    4.1
3  Men 14+   NaN  1930    6.0
4  Men 14+   NaN  1940    7.6

In [7]:
# removes all data with years prior to 1900
producitivty.head()

,Entity,Code,Year,Work hours per persons engaged,Productivity,Unnamed: 5
0,Afghanistan,AFG,1800,NaN,NaN,3280000
1,Afghanistan,AFG,1801,NaN,NaN,3280000
2,Afghanistan,AFG,1802,NaN,NaN,3280000
3,Afghanistan,AFG,1803,NaN,NaN,3280000
4,Afghanistan,AFG,1804,NaN,NaN,3280000

In [8]:
# removes all data with years prior to 1900
hours_weekly.head()

      Entity Code  Year   (hours per week)
0  Australia  AUS  1870               56.2
1  Australia  AUS  1880               53.3
2  Australia  AUS  1890               50.5
3  Australia  AUS  1900               48.1
4  Australia  AUS  1913               44.7